/*
Package encodings - поддержка сериализации событий.

Бинарное представление всех форматов событий должно начинаться с байта версии. Из-за особенностей реализации перлового
формата, верхние 3 бита зарезервированы под флаги, поэтому номер версии должен быть в диапазоне 0-31 (queuedproto.VersionMask).
По номеру версии определяется также и формат (см. tp.Queue.Register), поэтому это ограничение касается всех форматов - не только перлового.

Сейчас реализовано два формата - Perl и Protobuf, они задаются одноимёнными константами.

Для определения формата события можно воспользоваться методом Detect.

# Perl

Кроме основного payload, с которым вопросов возникать не должно (штатное кодирование средствами gitlab.cebc.tools/go/easygo.git/iproto
в queuedproto.PerlData.Data), перловый формат поддерживает два механизма передачи дополнительных данных
в TLV-формате: addons (MR::TP::Addon, используются в современных проектах на перле) и extensions (MR::Queue::Extensions, используются в MM).

Возможности обоих механизмов:

  - "прозрачная" (не нужно указывать в структуре формата события) передача некоторых полей
  - поля доступны через свойства объекта события
  - для некоторых типов реализовано автозаполнение

Расширения (extensions) пока не поддерживаются в go, аддоны реализованы, но для некоторых аддонов (Retry и Retry2) пока не реализована высокоуровневая логика.

Поддержка аддонов и расширений на уровне протокола queued описана там же: queuedproto.PerlData

Флаг FlagEncodeInUTF8 пока устанавливается при кодировании всегда. Это может вызывать небольшой оверхед при обработке событий без текстовых полей в перле.
При декодировании этот флаг ингорируется, т.к. не поддерживать utf8 go не умеет :)

Также в очередях перловых проектов возможно указывать формат сериализации поля (cbor, array_as_str и т.д.).
Всё это можно реализовать, объявляя методы IprotoPack/IprotoUnpack для своих структур.
Когда/если надоест - можно реализовать генераторы таких методов для указанных типов.

# Perl Addons

Реализованы следующие аддоны (указан перловый аналог):

  - addons.CreationTime  MR::TP::Addon::CreationTime
  - addons.Retry         MR::TP::Addon::Retry
  - addons.Retry2        MR::TP::Addon::Retry2
  - addons.Producer      MR::TP::Addon::Producer

Пакет addons входит в состав библиотеки queuedproto, где и реализован нижний уровень аддонов: gitlab.cebc.tools/dev/queued-go-lib/addons

Для использования аддонов, нужно вложить в свою структуру события нужные типы аддонов:

	type MyEvent struct {
		tp.Event
		addons.CreationTime
		addons.Producer
		UserID uint32
		MyData string
	}

	var _ tp.Handler = &MyEvent{}

Аддоны поддерживаются только на верхнем уровне структуры (не в других встроенных или именованных подструктурах).

Для реализации автозаполнения используется интерфейс tp.Builder (как и для самих событий). Если используется один
аддон, произойдёт автоматический проброс этого метода юзерской структуре, но если используется два и более аддонов с таким
методом, магии не произойдёт (таковы правила встраивания структур в go), поэтому нужно это реализовать вручную:

	func (ev *MyEvent) Build() {
		ev.CreationTime.Build()
		ev.Producer.Build()
	}

Можно создавать и свои аддоны, они должны соответствовать интерфейсу addons.PerlAddon (см. доки в этом пакете).
Однако, делать это рекомендуется исключительно для совместимости с какими-то (гипотетическими) новыми перловыми аддонами -
для взаимодействия с новыми проектами рекомендуется юзать формат Protobuf.

При реализации своих аддонов для методов AddonID и MarshalAddon ресивер можно принимать как по значению, так и по указателю.
Метод AddonID не должен использовать хранящиеся в событии данные (т.к. их ещё может и не быть).

# Protobuf

Структуру, сгенерённую из .proto-файла при помощи protoc-gen-go, вместе с tp.Event, нужно вложить в свою структуру,
для которой нужно будет определить метод Handle (и, возможно, Build и BuildEventID):

	type MyEvent struct {
		tp.Event
		eventpb.GeneratedEvent
	}

	var (
		_ tp.Handler    = &MyEvent{}
		_ proto.Message = &MyEvent{}
	)

Если структура не будет поддерживать интерфейс proto.Message (например, если вместо встраивания объявить поле с генерённым типом),
то эта структура будет зарегистрирована, как перловая, с использованием сериализации на базе easygo/iproto.
В таком случае не гарантируется возможность работы даже с этой же реализацией, не говоря уже о реализации на другом языке :)
*/
package encodings
